import React from "react";
import { BiComment, BiShareAlt, BiHeart } from "react-icons/bi";

function MainText() {
  return (
    <div>
      <p
        className="font-normal text-justify"
        style={{ fontSize: "16px", lineHeight: "42px" }}
      >
        لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده
        از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و
        سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای
        متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه
        درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با
        نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان
        خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید
        داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان
        رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات
        پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم
        متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان
        گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که
        لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف
        بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته،
        حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها
        شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ
        پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و
        دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد
        نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای
        موجود طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با
        تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است.
        چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و
        برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود
        ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و
        آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت
        بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در
        زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری
        موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز
        شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود
        طراحی اساسا مورد استفاده قرار گیرد. لورم ایپسوم متن ساختگی با تولید
        سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و
        متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط
        فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی
        می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان
        جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان
        رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد.
        در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و
        شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای
        اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
        قرار گیرد.
      </p>
      <div className="border-b-2 border-[#6b6b6b] h-[72px] mt-5 py-0 px-8 gap-10 flex justify-between items-center">
        <div className="w-[266px] h-[35px] flex justify-center gap-10">
          <p className="font-normal text-base rounded px-8 py-2 bg-[#ebebeb] text-[#6b6b6b]">
            تگ{" "}
          </p>
          <p className="font-normal text-base rounded px-8 py-2 bg-[#ebebeb] text-[#6b6b6b]">
            تگ{" "}
          </p>
          <p className="font-normal text-base rounded px-8 py-2 bg-[#ebebeb] text-[#6b6b6b]">
            تگ{" "}
          </p>
        </div>
        <div className="flex justify-between">
          <span className="p-2">
            <BiHeart />
          </span>
          <span className="p-2">
            <BiComment />
          </span>
          <span className="p-2">
            <BiShareAlt />
          </span>
        </div>
      </div>
    </div>
  );
}

export default MainText;
