import React from "react";

function Sidebar() {
  return (
    <>
      <div className="writer flex justify-start items-center">
        <div>
          <img
            src={require("../../assets/images/profile.png")}
            className="w-[118px] h-[118px] rounded"
          />
        </div>
        <div className="mr-3">
          <p className="text-2xl mb-2 text-right text-[#6b6b6b]">نام نویسنده</p>
          <span>icon</span>
        </div>
      </div>
      <div className="side-text mt-2 py-2 pr-5">
        <p className="text-justify text-base text-[#6b6b6b]">
          درباره نویسنده لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت
          چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و
          مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد
          نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای
          زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان
          را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی
          الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت
          می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت
          تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و
          جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار
          گیرد.
        </p>
      </div>
    </>
  );
}

export default Sidebar;
